app/views/trains/_form.html.erb

    <%= f.label :current_station, 'Текущая станция' %>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations"

    <%= f.label :route, 'Маршрут' %>
    <%= f.collection_select :route_id, Route.all, :id, :title %>
---
SELECT "routes".* FROM "routes"