app/views/trains/show.html.erb

  <strong>Назначен маршрут:</strong>
  <% if @train.route.present? %>
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  <strong>Количество плацкартных вагонов:</strong>
  <%= @train.cars.where(car_type: 'плацкарт').size %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ? AND "cars"."car_type" = ?  [["train_id", 5], ["car_type", "плацкарт"]]
SELECT COUNT(*) FROM "cars" WHERE "cars"."train_id" = ? AND "cars"."car_type" = ?  [["train_id", 1], ["car_type", "плацкарт"]]