app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)

    if @car.save
---
INSERT INTO "cars" ("car_type", "top_seat", "lower_seat", "created_at", "updated_at", "train_id") VALUES (?, ?, ?, ?, ?, ?)  [["car_type", "купе"], ["top_seat", 4], ["lower_seat", 6], ["created_at", 2017-03-14 15:41:46 UTC], ["updated_at", 2017-03-14 15:41:46 UTC], ["train_id", 1]]

  def update

    if @car.update(car_params)
---
UPDATE "cars" SET "car_type" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["car_type", "плацкарт"], ["updated_at", 2017-03-14 15:50:59 UTC], ["id", 1]]