app/controllers/railway_stations_controller.rb

  def create
    @railway_station = RailwayStation.new(railway_station_params)

    respond_to do |format|
      if @railway_station.save
---
INSERT INTO "railway_stations" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Пермь"], ["created_at", 2017-02-28 13:09:12 UTC], ["updated_at", 2017-02-28 13:09:12 UTC]]