app/controllers/routes_controller.rb

INSERT INTO "routes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Пермь - Санкт-Петербург"], ["created_at", 2017-03-01 11:47:13 UTC], ["updated_at", 2017-03-01 11:47:13 UTC]]
---
  def create
    @route = Route.new(route_params)

    if @route.save

UPDATE "routes" SET "title" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["title", "Пермь - Екатеринбург"], ["updated_at", 2017-03-01 12:01:29 UTC], ["id", 3]]
---
  def update

    if @route.update(route_params)

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 3]]
---
  def destroy
    @route.destroy