app/controllers/trains_controller.rb

  def show
    @sum_top_seat_pl = 0
    @sum_lower_seat_pl = 0
    @sum_top_seat_coupe = 0
    @sum_lower_seat_coupe = 0

    @train.cars.where(car_type: 'купе').each do |car|
---
SELECT "cars".* FROM "cars" WHERE "cars"."train_id" = ? AND "cars"."car_type" = ?  [["train_id", 5], ["car_type", "плацкарт"]]

  def create
    @train = Train.new(train_params)

    if @train.save
---
INSERT INTO "trains" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", 111], ["created_at", 2017-03-01 09:12:45 UTC], ["updated_at", 2017-03-01 09:12:45 UTC]]

  def update

    if @train.update(train_params)
---
UPDATE "trains" SET "current_station_id" = ?, "route_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["current_station_id", 2], ["route_id", 9], ["updated_at", 2017-03-09 15:23:48 UTC], ["id", 3]]