app/views/routes/show.html.erb

<p>
  <% if @route.trains.empty? %>
---
SELECT  1 AS one FROM "trains" WHERE "trains"."route_id" = ? LIMIT ?  [["route_id", 1], ["LIMIT", 1]]
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 1]]